cask_args appdir: '/Applications'

cask 'java'
cask 'textmate'

brew 'ack'
brew 'pcre'
brew 'xz'
brew 'the_silver_searcher'
brew 'unixodbc'
brew 'ag' 
brew 'readline', args: ['force']
brew 'sqlite'
brew 'aircrack-ng'
brew 'autoconf' 
brew 'brew-cask-completion'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'bfg'
brew 'binutils'
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'p7zip'
brew 'ssdeep'
brew 'binwalk'
brew 'cifer'
brew 'cloc'
brew 'colordiff'
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils', args: ['with-default-names']
brew 'cmake'
brew 'ctags'
brew 'curl'
brew 'dex2jar'
brew 'dns2tcp'
brew 'editorconfig'
brew 'elasticsearch'
brew 'fcrackzip'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils', args: ['with-default-names']
brew 'fontconfig'
brew 'foremost'
brew 'fzf'
brew 'freetype', args: ['force']
brew 'libtiff', args: ['force']
brew 'webp'
brew 'gd'
brew 'gdbm'
brew 'gem-completion'
brew 'gettext', args: ['force']
brew 'gflags'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'libgpg-error' 
brew 'libgcrypt'
brew 'libksba'
brew 'libassuan'
brew 'pinentry'
brew 'pth'
brew 'gpg-agent'
brew 'dirmngr'
brew 'libusb'
brew 'libusb-compat'
brew 'gpg'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
brew 'libtool', args: ['force']
brew 'graphviz'
brew 'grc'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'hashpump'
brew 'boost'
brew 'heroku'
brew 'lua'
brew 'highlight'
brew 'hub'
brew 'mysql', restart_service: true
brew 'hydra'
brew 'icoutils'
brew 'icu4c', args: ['force']
brew 'pkg-config'
brew 'imagemagick', args: ['with-webp']
brew 'jmeter'
brew 'john'
brew 'jpeg', args: ['force']
brew 'oniguruma'
brew 'jq'
brew 'knock'
brew 'libevent'
brew 'memcached', restart_service: true
brew 'libmemcached'
brew 'libssh2'
brew 'libgit2'
brew 'libpng'
brew 'libxml2', args: ['force']
brew 'libyaml'
brew 'libzip'
brew 'lynx'
brew 'mas'
# Install maven for Exakat
brew 'maven'
brew 'maven-completion'
brew 'mhash'
brew 'mcrypt'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'mtr'
brew 'jasper'
brew 'netpbm'
brew 'nmap'
brew 'node', args: ['with-full-icu']
brew 'nodebrew'
brew 'node-build'
brew 'nodenv'
brew 'npm'
brew 'openssl', args: ['force']
brew 'packer'
brew 'packer-completion'
brew 'percona-toolkit'
brew 'pigz'
brew 'pidcat'
brew 'postgres', restart_service: true
brew 'pngcheck'
brew 'pv'
#brew 'python'
#brew 'python3'
brew 'wxmac'
brew 'erlang'
brew 'rabbitmq'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby', args: ['force']
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'rename'
brew 'rhino'
brew 'screen'
brew 'shellcheck'
brew 'socat'
brew 'source-highlight'
brew 'speedtest_cli'
brew 'sqlite3', args: ['force']
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'libdnet'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'testssl'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'ucspi-tcp'
brew 'unrar'
brew 'v8'
brew 'varnish'
brew 'vbindiff'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
brew 'libpng'
brew 'libtiff'
brew 'wine'
brew 'winetricks'
brew 'xpdf'
brew 'zopfli'

### Install PHP 5.5
brew 'homebrew/php/php55'
brew 'homebrew/php/blackfire-php55'
brew 'php55-apcu'
brew 'php55-igbinary' 
brew 'php55-intl'
brew 'php55-mcrypt'
brew 'php55-memcache'
brew 'php55-memcached'
brew 'php55-mongo'
brew 'php55-oauth'
brew 'php55-opcache'
brew 'php55-redis'
brew 'php55-solr'
brew 'php55-tidy'
brew 'php55-twig'
brew 'php55-xdebug'
brew 'php55-xhprof'
brew 'php55-yaml'

`brew unlink php55`

### Install PHP 5.6
brew 'homebrew/php/php56'

`brew link --overwrite php56`

brew 'blackfire-php56'
brew 'php56-apcu'
brew 'php56-igbinary' 
brew 'php56-intl'
brew 'php56-mcrypt'
brew 'php56-memcache'
brew 'php56-memcached'
brew 'php56-mongo'
brew 'php56-oauth'
brew 'php56-opcache'
brew 'php56-redis'
brew 'php56-solr'
brew 'php56-tidy'
brew 'php56-twig'
brew 'php56-xdebug'
brew 'php56-xhprof'
brew 'php56-yaml'

`brew unlink php56`

### Install PHP 7.0
brew 'homebrew/php/php70'

`brew link --overwrite php70`

brew 'php70-igbinary', args: %w['HEAD']
brew 'php70-memcached', args: %w[HEAD]
#brew 'php70-memcache'
brew 'php70-opcache'
brew 'php70-apcu'
brew 'php70-mcrypt'
brew 'php70-intl'
brew 'php70-xdebug'
#brew 'php70-twig'
brew 'php70-mongodb'
brew 'php70-oauth'
brew 'php70-solr'
brew 'php70-ast'
brew 'php70-tidy'
brew 'blackfire-php70'
brew 'php70-redis', args: %w[HEAD]
brew 'php70-yaml', args: %w[HEAD]

`brew unlink php70`

### Install PHP 7.1
brew 'homebrew/php/php71'

`brew link php71`

brew 'php71-igbinary'
brew 'php71-memcached', args: %w[HEAD]
#brew 'php71-memcache'
brew 'php71-opcache'
brew 'php71-apcu'
brew 'php71-mcrypt'
brew 'php71-intl'
brew 'php71-xdebug'
#brew 'php71-twig'
brew 'php71-mongodb'
brew 'php71-oauth'
brew 'php71-solr'
brew 'php71-ast'
brew 'php71-tidy'
brew 'blackfire-php71'
brew 'php71-redis', args: %w[HEAD]
brew 'php71-yaml', args: %w[HEAD]

brew 'codeception'
brew 'composer'
brew 'blackfire-agent'
brew 'pdepend'
brew 'phan'
brew 'phing'
brew 'phpcpd'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phpdocumentor'
brew 'phpdox'
brew 'phploc'
brew 'phpmd'
brew 'phpmetrics'
brew 'phpunit'
brew 'phpunit-skeleton-generator'
brew 'symfony-installer'
brew 'jenkins'