cask_args appdir: '/Applications'

cask 'java'
cask 'textmate'

brew 'ack'
brew 'pcre'
brew 'xz'
brew 'the_silver_searcher'
brew 'unixodbc'
brew 'ag' 
brew 'readline', args: ['force']
brew 'sqlite'
brew 'aircrack-ng'
brew 'autoconf' 
brew 'brew-cask-completion'
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'bfg'
brew 'binutils'
brew 'gmp'
brew 'mpfr'
brew 'libmpc'
brew 'isl'
brew 'gcc'
brew 'p7zip'
brew 'ssdeep'
brew 'binwalk'
brew 'cifer'
brew 'cloc'
brew 'colordiff'
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
brew 'cmake'
brew 'ctags'
brew 'curl'
brew 'dex2jar'
brew 'dns2tcp'
brew 'editorconfig'
brew 'elasticsearch'
brew 'fcrackzip'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'fontconfig'
brew 'foremost'
brew 'fzf'
brew 'freetype', args: ['force']
brew 'libtiff', args: ['force']
brew 'webp'
brew 'gd'
brew 'gdbm'
brew 'gem-completion'
brew 'gettext', args: ['force']
brew 'gflags'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'libgpg-error' 
brew 'libgcrypt'
brew 'libksba'
brew 'libassuan'
brew 'pinentry'
brew 'pth'
brew 'gpg-agent'
brew 'dirmngr'
brew 'libusb'
brew 'libusb-compat'
brew 'gpg'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
brew 'libtool', args: ['force']
brew 'graphviz'
brew 'grc'
brew 'homebrew/dupes/grep', args: ['with-default-names']
brew 'hashpump'
brew 'boost'
brew 'heroku'
brew 'lua'
brew 'highlight'
brew 'hub'
brew 'mysql', restart_service: true
brew 'hydra'
brew 'icoutils'
brew 'icu4c', args: ['force']
brew 'pkg-config'
brew 'imagemagick', args: ['with-webp']
brew 'jmeter'
brew 'john'
brew 'jpeg', args: ['force']
brew 'oniguruma'
brew 'jq'
brew 'knock'
brew 'libevent'
brew 'memcached', restart_service: true
brew 'libmemcached'
brew 'libssh2'
brew 'libgit2'
brew 'libpng'
brew 'libxml2', args: ['force']
brew 'libyaml'
brew 'libzip'
brew 'lynx'
brew 'mas'
# Install maven for Exakat
brew 'maven'
brew 'maven-completion'
brew 'mhash'
brew 'mcrypt'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'mtr'
brew 'jasper'
brew 'netpbm'
brew 'nmap'
brew 'node', args: ['with-full-icu']
brew 'nodebrew'
brew 'node-build'
brew 'nodenv'
brew 'node@6', args: ['with-full-icu']
brew 'npm'
brew 'nvm'
brew 'openssl', args: ['force']
brew 'packer'
brew 'packer-completion'
brew 'percona-toolkit'
brew 'pigz'
brew 'pidcat'
brew 'postgres', restart_service: true
brew 'pngcheck'
brew 'pv'
#brew 'python3'
brew 'wxmac'
brew 'erlang'
brew 'rabbitmq'
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'ruby', args: ['force']
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'rename'
brew 'rhino'
brew 'screen'
brew 'shellcheck'
brew 'socat'
brew 'source-highlight'
brew 'speedtest_cli'
brew 'sqlite3', args: ['force']
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'libdnet'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'testssl'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'ucspi-tcp'
brew 'unrar'
brew 'v8'
brew 'varnish'
brew 'vbindiff'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
brew 'libpng'
brew 'libtiff'
brew 'zopfli'
brew 'python'
brew 'ansible'
brew 'mongodb'
brew 'httpd24', args: ['with-privileged-ports', 'with-http2']
brew 'elasticsearch'
