cask_args appdir: '/Applications'
cask 'java'
cask 'textmate'

brew 'brew-cask'
brew 'ack'
brew 'ag' 
brew 'autoconf' 
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'blackfire-agent'
brew 'brew-gem'
brew 'brew-pip'
brew 'cloc'
brew 'colordiff'
brew 'composer'
brew 'curl'
brew 'gettext'
brew 'git'
brew 'git-flow'
brew 'gpg'
brew 'graphviz'
brew 'highlight'
brew 'icoutils'
brew 'icu4c'
brew 'imagemagick'
brew 'libmemcached'
brew 'libxml2'
brew 'maven'
brew 'mcrypt'
brew 'memcached', restart_service: true
brew 'mhash'
brew 'mysql', restart_service: true
brew 'node'
brew 'nodebrew'
brew 'nodenv'
brew 'npm'
brew 'openssl'
brew 'pcre'
brew 'pdepend'
brew 'pgadmin3'
brew 'phan'
brew 'phpcpd'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phploc'
brew 'phpmd'
brew 'phpmetrics'
brew 'phpunit'
brew 'phpunit-skeleton-generator'
brew 'postgres', restart_service: true
brew 'rabbitmq'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-readline'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'ruby-build'
brew 'ruby'
brew 'sqlite3'
brew 'symfony-installer'
brew 'tidy-html5'
brew 'tmux'
brew 'universal-ctags', args: %w['HEAD']
brew 'unixodbc'
brew 'varnish'
brew 'v8'
brew 'wget'
brew 'wine'
