cask_args appdir: '/Applications'
cask 'java'
cask 'textmate'

brew 'ack'
brew 'ag' 
brew 'aircrack-ng'
brew 'autoconf' 
brew 'bash-completion'
brew 'bash-git-prompt'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'blackfire-agent'
brew 'brew-cask'
brew 'brew-gem'
brew 'brew-pip'
brew 'cifer'
brew 'cloc'
brew 'colordiff'
brew 'composer'
# Install GNU core utilities (those that come with macOS are outdated).
brew 'coreutils'
brew 'curl'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew 'findutils'
brew 'foremost'
brew 'gettext'
brew 'git'
brew 'git-flow'
brew 'git-lfs'
brew 'gpg'
# Install GNU `sed`, overwriting the built-in `sed`.
brew 'gnu-sed', args: ['with-default-names']
brew 'graphviz'
brew 'grep'
brew 'hashpump'
brew 'highlight'
brew 'hydra'
brew 'icoutils'
brew 'icu4c'
brew 'imagemagick', args: ['with-webp']
brew 'john'
brew 'knock'
brew 'libmemcached'
brew 'libxml2'
brew 'lua'
brew 'lynx'
# Install maven for Exakat
brew 'maven'
brew 'mcrypt'
brew 'memcached', restart_service: true
brew 'mhash'
# Install some other useful utilities like `sponge`.
brew 'moreutils'
brew 'mysql', restart_service: true
brew 'netpbm'
brew 'nmap'
brew 'node'
brew 'nodebrew'
brew 'nodenv'
brew 'npm'
brew 'openssl'
brew 'p7zip'
brew 'pcre'
brew 'pdepend'
brew 'pgadmin3'
brew 'phan'
brew 'phpcpd'
brew 'php-code-sniffer'
brew 'php-cs-fixer'
brew 'phploc'
brew 'phpmd'
brew 'phpmetrics'
brew 'phpunit'
brew 'phpunit-skeleton-generator'
brew 'pigz'
brew 'postgres', restart_service: true
brew 'pngcheck'
brew 'pv'
brew 'rabbitmq'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'rbenv-readline'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'redis', restart_service: true
brew 'rename'
brew 'rhino'
brew 'ruby'
brew 'ruby-build'
brew 'screen'
brew 'socat'
brew 'speedtest_cli'
brew 'sqlite3'
brew 'sqlmap'
brew 'ssh-copy-id'
brew 'symfony-installer'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'testssl'
brew 'tidy-html5'
brew 'tmux'
brew 'tree'
brew 'ucspi-tcp'
brew 'universal-ctags', args: %w['HEAD']
brew 'unixodbc'
brew 'v8'
brew 'varnish'
brew 'vbindiff'
brew 'webkit2png'
brew 'wget', args: ['with-iri']
brew 'wine'
brew 'xpdf'
brew 'xz'
brew 'zopfli'
